/*



Земные бухгалтеры одержали первую значительную победу над инопланетным разумом и уговорили пришельцев изменить принцип формирования зарплатных ведомостей. Отныне ведомость представляет из себя мешанину из чисел и значений null (наиболее точный перевод с языка пришельцев - тяжелый вздох и обреченное согласие с младшей формой жизни после часа препирательств). Количество значений null отображает удовлетворенность работой землянина - чем меньше, тем лучше.

Создайте функцию calcNullValues(input: Array<Int?>):Array<Int> , возвращающую массив, первым элементом которого является количество null-значений в массиве input, а вторым - сумма всех не-null значений.

Из консоли/В консоль ничего читать/писать не нужно!

Sample Input:

82 null null null null null 7 55 null 59 4 25 null null 66 null 3 62 55 null 42 5 35 8 null

Sample Output:

11 508


*/

fun calcNullValues(input: Array<Int?>):Array<Int>{

    // Add your code
    var sum = 0;
    var sumNull = 0;
    for (item in input) {
        if (item != null) {
            sum += item
        } else {
            sumNull ++
        }
    }
    // Add your code
    return arrayOf(sumNull,sum)
}